# PointCloudOverrideSettings Constructor (PointCloudOverrideSettings) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudOverrideSettings Constructor (PointCloudOverrideSettings)
PointCloudOverrideSettings Class See Also
---
Constructs a copy of source object.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PointCloudOverrideSettings(
	PointCloudOverrideSettings other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As PointCloudOverrideSettings _
)
```

Visual C++
---
```text
public:
PointCloudOverrideSettings(
	PointCloudOverrideSettings^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.PointClouds..::..PointCloudOverrideSettings Source object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PointCloudOverrideSettings Class
PointCloudOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace